# Обзор предыдущих занятий

# Урок 51 - Функции. Часть 10. Создание своего Челленджа на тему Функции
# Урок 50 - Функции. Часть 9. Челлендж
# Урок 50 - Функции. Часть 9. Челлендж на создание функций
# Урок 49.2 - Функции. Часть 8. Парсинг сайта - Пицца Додо
# Урок 49.1 - Функции. Часть 8. Погода с сайта Яндекс.Погода
# Урок 48 - Функции. Часть 7. Ёлка.
# Урок 47 - Функции. Часть 6 - Решение квадратных уравнений вида ax^2 + bx + c = 0
# Урок 46 - Функции. Часть 5 - Два простых практических задания.
# Урок 45 - Функции. Часть 4 - Практические задания.
# Урок 44 - Функции. Часть 3 - Функции возвращающие значение.
# Урок 43 - Функции. Часть 2 - Функции с параметрами. Пространство имён.
# Урок 42 - Функции. Часть 1 - Функции с параметрами.
# Урок 41 - Функции. Часть 1 - вводная.

# Урок 40 - Словари. Часть 9.
# Урок 39 - Словари. Часть 8 - заключительная.
# Урок 38 - Словари. Часть 7.
# Урок 37 - Словари. Часть 6.
# Урок 36 - Словари. Часть 5.
# Урок 35 - Словари. Часть 4. Таблица: "Типы данных" - https://vk.cc/aBWHhi #Разбор примера "Танки".
# Урок 34 - Словари. Часть 3. Таблица: "Типы данных" - https://vk.cc/aBWHhi
# Урок 33 - Словари. Часть 2. Таблица: "Типы данных" - https://vk.cc/aBWHhi
# Урок 32 - Словари (см. таблицу: "Типы данных - https://vk.cc/aBWHhi")

# Урок 31 - Анализ и обработка текста. Работа с файлами. Разбор задачи.
# Урок 30 - Анализ и обработка текста. Работа с файлами. Проверка времени выполнения алгоритма.
# Урок 29 - Анализ и обработка текста. Работа с файлами.

# Урок 28 - Закрепление пройденного материала.

# Урок 27 - Логический тип bool, условия и операции над ними, условные операторы.
# Урок 26 - Логический тип bool, условия и операции над ними, условные операторы.

# Урок 25 - Применение функции range в библиотеке turtle.

# Урок 24 - Строки, Списки и Общие операции над ними.

# Урок 23 - Функция range

# Урок 22 - Циклы. Цикл for - Самостоятельная работа.
# Урок 21 - Циклы. Цикл for - Практическое задание.
# Урок 20 - Циклы. Цикл for.

# Урок 19 - Оболочка Shell, командная строка. Циклы. Цикл for.

# Урок 18 - Типы данных. Списки. Разбор Итоговой.
# Урок 17 - Типы данных. Списки. Итоговая.
# Урок 16 - Типы данных. Списки и циклы. Часть 5.
# Урок 15 - Типы данных. Списки. Часть 4.
# Урок 14 - Типы данных. Списки. Часть 3.
# Урок 13 - Типы данных. Списки. Часть 2.
# Урок 12 - Типы данных. Списки. Часть 1.
# Урок 11 - Типы данных. Оператор присваивания.
# Урок 10 - Типы данных. Строки - Разбор Контрольной.
# Урок 9 - Типы данных. Строки - Часть 5. Контрольная.
# Урок 8 - Типы данных. Строки - Заключительная, обзорная Часть 4.
# Урок 6 - Типы данных. Обработка Строк - Часть 3.
# Урок 6 - Типы данных. Обработка Строк - Часть 2.
# Урок 5 - Типы данных. Обработка Строк.
# Урок 3 - Типы данных. Числа. (bit.ly/2WRAK46 - "Типы данных в Python. Таблица.")
# Урок 2 - Типы данных.

# Урок 1 - Вводное занятие.
