autor = 'Екатерина Адасова'
title = 'Малосольные огурчики'

text = """
У магазинчика с вывеской «Фрукты – овощи»  стояли два ряда длинных деревянных прилавков. В выходной день прилавки занимали жители, которые могли что-то продать со своих огородов. Не везти же грибы, картошку, морковку, седок на Центральный рынок, где мелким продавцам место не всегда доставалось.  А уж здесь и спокойно, и покупатели из соседних домов. Да и все друг друга хорошо знали.
- Привет, девчата, - крикнула Шурочка всем, кто уже занял места в первом ряду.
Шурочка была маленькой, тоненькой, юркой и крикливой. Торговля у нее шла всегда быстро. За ужимки и быстроту придумали торговки для Шурочки еще и другое имя – Обезьянка. Шутливое и доброе прозвище.
   
- Твое место свободно, - сказала Зина, которая раскладывала пучки с зеленью. 
Зина крепкая, кругленькая сейчас поливала обильно ровненькие пучки петрушки и укропа.
- Мой еще не приходил? – спросила Шурочка.
Все знали, что у Шурочки появился особенный покупатель, молодой мужчина, который не пропускал ни одного выходного дня. И уже месяц приходил за товаром Шурочки.
Был мужчина высок, строен, аккуратен. Приносил свою чистую баночку для малосольных огурчиков. А   вот лицо было какое-то не доброе. Глаза темные, круглые, неподвижные. Зубы крупные, острые были видны. Странная улыбка не сходила с лица мужчины.
 Женщины называли мужчину, имя которого было Егор, прозвищем «Крокодил». 
– Не приходил, не приходил твой жених, жди, скоро появится, - ответила Рая, которая чуть приподняла полотенце на корзине, чтобы показать, что там свеженькие, крепкие подосиновики.
- Ухаживает. Хорошо ухаживает, - заметила Зина. – Позавидуешь. Не мой алкаш.
- Я вот тоже свободная девушка, а он Шурочку выбрал, -  сказала с завистью Рая.
- Ох, девочки, скоро я от вас уеду. Не стоять мне здесь за прилавком. Уедем с Егором на его родину, будем вместе жить. Уж так меня там ждут его родители.
- Как так?
- Что быстро? - загалдели женщины.
- Зовет, зовет, - мечтательно произнесла Шурочка, продолжая раскладывать огурчики по литровым баночкам, подливая в каждую немного рассола.
- Ну, что ж. Замуж нужно. Здесь мужиком не пьющих, не найдешь. А по виду он серьезный.
- Вот и вещи все собрала, - сообщила Шурочка. – дело решенное.

Женщины замолчали, подготовка товара прошла, осталось ждать покупателей. Подошли и первые покупатели. Не очень разговорчивые, торопливые, еще ото сна не очнувшиеся.
- Что-то твоего жениха не видно, - заметила Зина.
- Может быть, за билетами на вокзал поехал, -  предположила Шурочка. – Теперь он у меня за все отвечает.
Женщины не сразу заметили незнакомую женщину, которая внимательно смотрела на банки с малосольными огурцами.
- Вам огурчиков? – спросила Шурочка. – Выбирайте, очень крепкие. Маленькие. Хрустящие. С пупырышками.
- Нет. Огурцы твои не нужны.
- Может грибочков? – подсуетилась Рая.
- Значит это ты к моему мужу клеишься. Мужик на работу сюда приехал. Месяца не прошло, как желающие в новые жжены появились.

Могучая тетка наклонилась над ветром с огурцами, над банками с огурцами, подготовленными для продажи. С вязанной белой кофты на зеленые огурцы сыпались тонкие ниточки шерсти. Шурочке показалось, что сейчас ее схватят в крепкие руки и съедят. И тетка уже не казалась теткой, а выглядела как страшная горилла. И зубы у нее торчали,  острые и белые.
- Думаю, что все  поняла.
Как неожиданно появилась женщина, так и исчезла. Словно с дерева спустилась, а потом на дерево и поднялась. Только рядом никаких могучих деревьев не было.
Женщины долго молчали. Не знали, что сказать. И Шурочка словно окаменела. Не шевелились ее тоненькие ручки, не бегали маленькие глазки. Даже белые кудряшки замерли вместе с хозяйкой. И поджался невидимый хвостик маленькой, пугливой обезьянки.
- Смотри, смотри, покупатели идут, - крикнула Зина.
- Все разберут, грибы не застояться, - обрадовалась рая.
- Что остановилась? -  крикнула Зина Шурочке.
- Твои крокодилы уплыли. Что Егор, как крокодил, что и его жена словно крокодилиха, - засмеялась Рая.

Торговля шла быстро. Покупателей было много, товар разошелся свежим. Через два часа прилавки опустели. И наступила тишина.
По дороге домой Шурочка все же немного всплакнула. Чистыми слезами. С чистой печалью о несостоявшемся счастье. 
"""

