# Обзор предыдущих занятий


# Урок 51 - онлайн. Python
# Функции. Часть 10. Создание своего Челленджа на тему Функции

# Урок 50 - онлайн. Python
# Функции. Часть 9. Челлендж

# Урок 50 - онлайн. Python
# Функции. Часть 9. Челлендж на создание функций

# Урок 49.2 - онлайн. Python
# Функции. Часть 8. Парсинг сайта - Пицца Додо

# Урок 49.1 - онлайн. Python
# Функции. Часть 8. Погода с сайта Яндекс.Погода

# Урок 48 - онлайн. Python
# Функции. Часть 7. Ёлка.

# Урок 47 - онлайн. Python
# Функции. Часть 6 - Решение квадратных уравнений вида ax^2 + bx + c = 0

# Урок 46 - онлайн. Python
# Функции. Часть 5 - Два простых практических задания.

# Урок 45 - онлайн. Python
# Функции. Часть 4 - Практические задания.

# Урок 44 - онлайн. Python
# Функции. Часть 3 - Функции возвращающие значение.

# Урок 43 - онлайн. Python
# Функции. Часть 2 - Функции с параметрами. Пространство имён.

# Урок 42 - онлайн. Python
# Функции. Часть 1 - Функции с параметрами.

# Урок 41 - онлайн. Python
# Функции. Часть 1 - вводная.

# Урок 40 - онлайн. Python
# Словари. Часть 9.

# Урок 39 - онлайн. Python
# Словари. Часть 8 - заключительная.

# Урок 38 - онлайн. Python
# Словари. Часть 7.

# Урок 37 - онлайн. Python
# Словари. Часть 6.

# Урок 36 - онлайн. Python
# Словари. Часть 5.

# Урок 35 - онлайн. Python
# Словари. Часть 4. Таблица: "Типы данных" - https://vk.cc/aBWHhi
# Разбор примера "Танки".

# Урок 34 - онлайн. Python
# Словари. Часть 3. Таблица: "Типы данных" - https://vk.cc/aBWHhi

# Урок 33 - онлайн. Python
# Словари. Часть 2. Таблица: "Типы данных" - https://vk.cc/aBWHhi

# Урок 32 - онлайн. Python
# Словари (см. таблицу: "Типы данных - https://vk.cc/aBWHhi")

# Урок 31 - онлайн. Python
# Анализ и обработка текста. Работа с файлами. Разбор задачи.

# Урок 30 - онлайн. Python
# Анализ и обработка текста. Работа с файлами. Проверка времени выполнения алгоритма.

# Урок 29 - онлайн. Python
# Анализ и обработка текста. Работа с файлами.

# Урок 28 - онлайн. Python
# Закрепление пройденного материала.

# Урок 27 - онлайн. Python
# Логический тип bool, условия и операции над ними, условные операторы.

# Урок 26 - онлайн. Python
# Логический тип bool, условия и операции над ними, условные операторы.

# Урок 25 - онлайн. Python
# Применение функции range в библиотеке turtle.

# Урок 24 - онлайн. Python
# Строки, Списки и Общие операции над ними.

# Урок 23 - онлайн. Python
# Функция range

# Урок 22 - онлайн. Python.
# Циклы. Цикл for - Самостоятельная работа.

# Урок 21 - онлайн. Python.
# Циклы. Цикл for - Практическое задание.

# Урок 20 - онлайн. Python.
# Циклы. Цикл for.

# Урок 19 - онлайн. Python.
# Оболочка Shell, командная строка. Циклы. Цикл for.

# Урок 18 - онлайн. Python.
# Типы данных. Списки. Разбор Итоговой.

# Урок 17 - онлайн. Python.
# Типы данных. Списки. Итоговая.

# Урок 16 - онлайн. Python.
# Типы данных. Списки и циклы. Часть 5.

# Урок 15 - онлайн. Python.
# Типы данных. Списки. Часть 4.

# Урок 14 - онлайн. Python.
# Типы данных. Списки. Часть 3.

# Урок 13 - онлайн. Python.
# Типы данных. Списки. Часть 2.

# Урок 12 - онлайн. Python.
# Типы данных. Списки. Часть 1.

# Урок 11 - онлайн. Python.
# Типы данных. Оператор присваивания.

# Урок 10 - онлайн. Python.
# Типы данных. Строки - Разбор Контрольной.

# Урок 9 - онлайн. Python.
# Типы данных. Строки - Часть 5. Контрольная.

# Урок 8 - онлайн. Python
# Типы данных. Строки - Заключительная, обзорная Часть 4.

# Урок 6 - онлайн. Python
# Типы данных. Обработка Строк - Часть 3.

# Урок 6 - онлайн. Python
# Типы данных. Обработка Строк - Часть 2.

# Урок 5 - онлайн. Python
# Типы данных. Обработка Строк.

# Урок 3 - онлайн. Python
# Типы данных. Числа. (bit.ly/2WRAK46 - "Типы данных в Python. Таблица.")

# Урок 2 - онлайн. Python
# Типы данных.

# Урок 1 - онлайн. Python
# Вводное занятие.
