# Обзор предыдущих занятий


# Урок 51 - онлайн. Python
# Функции. Часть 10. Создание своего Челленджа на тему Функции

# Урок 50 - онлайн. Python
# Функции. Часть 9. Челлендж

# Урок 50 - онлайн. Python
# Функции. Часть 9. Челлендж на создание функций

# Урок 49.2 - онлайн. Python
# Функции. Часть 8. Парсинг сайта - Пицца Додо

# Урок 49.1 - онлайн. Python
# Функции. Часть 8. Погода с сайта Яндекс.Погода

# Урок 48 - онлайн. Python
# Функции. Часть 7. Ёлка.

# Урок 47 - онлайн. Python
# Функции. Часть 6 - Решение квадратных уравнений вида ax^2 + bx + c = 0

# Урок 46 - онлайн. Python
# Функции. Часть 5 - Два простых практических задания.

# Урок 45 - онлайн. Python
# Функции. Часть 4 - Практические задания.
