# Урок 53 - Кортежи. Часть 1
# Lesson 53 - Tuples. Part 1

# создание кортежей
tuple1 = ()
tuple2 = (1, 2, 'hello')
tuple3 = 3, 4, 'John'
tuple4 = tuple('hello there')

print(type(tuple1))
print(type(tuple2))
print(type(tuple3))
print(type(tuple4))

print(1, 4, "Hello", 3.14)  # в функции параметры передаются в виде кортежа

print(tuple3.index('John'))

names = 'john', 'helen', 'john'
print(names.count('john'))


# Задание1 - Создать кортеж с несколькими повторяющимися цифрами,
# посчитать сколько там дублей
# Матвей

# Задание2 - создать кортеж из нескольких кортежей и извлечь из
# него все значения на экран
# Алексей

# Задание3 - посчитать сумму элементов кортежа состоящего из чисел
# Александр Г.

# Задание4 - создать кортеж и подсчитать сколько в нём элементов
# Влад

# Задание5 - создать произвольный кортеж и вернуть каждый третий
# элемент
# Влад

# Задание6 - вывести из кортежа цифры которые повторяются чаще 2-х
# раз
# Алексей

# Задание7 - создать кортеж из чисел и возвести случайный элемент в
# 3 степень
# Александр Р.

# Задание8 - создать из цифр кортеж и умножить случайный элемент
# на последний элемент все его значения
# Александр Р.

# Задание9 - создать кортеж и вывести любую половину всех элементов
# Матвей

# Задание10 - создать кортеж с определенным набором чисел и вывести
# рандомное
# Артём

# Задание11 - создать произвольный кортеж и посчитать сколько в нём
# слов и сколько чисел
# Артём

# Задание12 - создать кортеж состоящий из одного элемента - слова
# и получить его через индекс и вывести три раза
# Александр Г.
